# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2         320
   [-1, 1, GhostConv, [128, 3, 2]],  # 1-P2/4      160
   [-1, 3, C3Ghost, [128]],                       #160
   [-1, 1, GhostConv, [256, 3, 2]],  # 3-P3/8     80
   [-1, 6, C3Ghost, [256]],                       #80
   [-1, 1, GhostConv, [512, 3, 2]],  # 5-P4/16    40
   [-1, 9, C3Ghost, [512]],                       #40
   [-1, 1, GhostConv, [1024, 3, 2]],  # 7-P5/32   20
   [-1, 3, C3Ghost, [1024]],                     #20
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                    #20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    #40
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4   40   11+6
   [-1, 3, C3_Res2Block, [512, False]],  # 13                40

   [-1, 1, Conv, [256, 1, 1]],                    #40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    #80
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3   80  15+4
   [-1, 3, C3_Res2Block, [256, False]],  # 17 (P3/8-small)   80

   [-1, 1, Conv, [256, 3, 2]],                   #40
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3_Res2Block, [512, False]],  # 40 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],                    #20
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3_Res2Block, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
